{
  "subject": "English E2",
  "chapter": "The Listeners",
  "type": "make_sentences",
  "questions": [
    {"id": "tl_ms_header1", "word": "--- TEXTBOOK VOCABULARY ---", "meaning": "Words given at the back of the chapter", "sample_sentence": ""},
    {"id": "tl_ms_1", "word": "champed", "meaning": "chewed or bit upon noisily; munched", "sample_sentence": "I champed the delicious idiappam served by Sastha Catering Services."},
    {"id": "tl_ms_2", "word": "cropping", "meaning": "grazing; eating grass or plants by biting off the tops", "sample_sentence": "I saw a ravenous cow cropping the thick grass we had grown just outside our house."},
    {"id": "tl_ms_3", "word": "descended", "meaning": "moved downward; came down from a higher place", "sample_sentence": "My music teacher descended and opened the door when I rang the doorbell at her house."},
    {"id": "tl_ms_4", "word": "ferny", "meaning": "covered with or full of ferns (a type of leafy plant)", "sample_sentence": "There is an old abandoned ferny compound near my house in Chennai."},
    {"id": "tl_ms_5", "word": "hearkening", "meaning": "listening attentively; paying attention to sounds", "sample_sentence": "My Dhrupad teacher asks me to constantly be hearkening in the class to whatever he is demonstrating."},
    {"id": "tl_ms_6", "word": "'neath", "meaning": "poetic form of 'beneath'; under or below", "sample_sentence": "The book that I was searching for was lying 'neath my bed."},
    {"id": "tl_ms_7", "word": "perplexed", "meaning": "confused and puzzled; unable to understand something", "sample_sentence": "My father created a course named Way2top for people perplexed with what career to choose."},
    {"id": "tl_ms_8", "word": "phantom", "meaning": "a ghost or spirit; something that appears to exist but has no physical reality", "sample_sentence": "My cousin Prahlad says that there is nothing like a phantom that exists in this world."},
    {"id": "tl_ms_9", "word": "sill", "meaning": "the horizontal piece at the bottom of a window or door frame", "sample_sentence": "The window sills in my house are made large enough to allow us to sit on them."},
    {"id": "tl_ms_10", "word": "smote", "meaning": "past tense of 'smite'; struck or hit with force", "sample_sentence": "The Swiggy delivery guy smote upon our door when no one opened the door in response to the doorbell."},
    {"id": "tl_ms_11", "word": "spake", "meaning": "an archaic past tense of 'speak'; spoke", "sample_sentence": "As Suvasana spake very rudely to me, I got angry with her."},
    {"id": "tl_ms_12", "word": "stirrup", "meaning": "a metal loop that hangs from a horse's saddle to support the rider's foot", "sample_sentence": "My feet couldn't reach the stirrup of the horse when I wanted to ride it during our vacation."},
    {"id": "tl_ms_13", "word": "turf", "meaning": "grass and the surface layer of earth held together by its roots", "sample_sentence": "My friend Yohann plays tennis on a special turf made for children."},
    {"id": "tl_ms_14", "word": "turret", "meaning": "a small tower, especially one at the corner of a building or castle", "sample_sentence": "The chimneys I saw during a factory visit looked similar to turrets in old British buildings."},
    {"id": "tl_ms_header2", "word": "--- ADDITIONAL VOCABULARY ---", "meaning": "Other important words from the poem", "sample_sentence": ""},
    {"id": "tl_ms_15", "word": "dwelt", "meaning": "lived or resided in a place", "sample_sentence": "The ancient tribe dwelt in the valley for centuries before migrating to the coastal regions."},
    {"id": "tl_ms_16", "word": "stillness", "meaning": "the quality of being still; absence of movement or sound; complete quiet", "sample_sentence": "The stillness of the library was broken only by the occasional turning of pages by the students."},
    {"id": "tl_ms_17", "word": "surged", "meaning": "moved suddenly and powerfully forward or upward, like a wave", "sample_sentence": "The crowd surged forward when the gates opened, everyone eager to get the best seats for the concert."},
    {"id": "tl_ms_18", "word": "plunging", "meaning": "falling or moving suddenly and forcefully downward or forward", "sample_sentence": "The waterfall was plunging from the cliff into the deep pool below, creating a magnificent spray of water."},
    {"id": "tl_ms_19", "word": "shadowiness", "meaning": "the quality of being shadowy; full of shadows; dark and indistinct", "sample_sentence": "The shadowiness of the old mansion made it difficult to see clearly as we explored its abandoned rooms."},
    {"id": "tl_ms_20", "word": "lone", "meaning": "solitary; standing alone; without companions", "sample_sentence": "A lone traveler walked along the deserted road as the sun began to set behind the mountains."},
    {"id": "tl_ms_21", "word": "eerie", "meaning": "strange and frightening; mysterious in an unsettling way", "sample_sentence": "An eerie silence fell over the forest at midnight, making the campers feel uneasy in their tents."},
    {"id": "tl_ms_22", "word": "thronging", "meaning": "crowding together in large numbers; gathering densely", "sample_sentence": "Thousands of fans were thronging the stadium entrance, eager to watch the final match of the cricket series."},
    {"id": "tl_ms_23", "word": "echoing", "meaning": "repeating or reverberating sound; reflecting sound waves", "sample_sentence": "Her laughter kept echoing through the empty corridor, bouncing off the stone walls of the ancient building."},
    {"id": "tl_ms_24", "word": "moonlit", "meaning": "illuminated by the light of the moon", "sample_sentence": "The couple walked hand in hand along the moonlit beach, enjoying the peaceful evening by the sea."},
    {"id": "tl_ms_25", "word": "host", "meaning": "a large number of people or things; a multitude", "sample_sentence": "A host of butterflies emerged from the garden, creating a colorful display against the blue sky."}
  ]
}
