{
  "subject": "English E2",
  "chapter": "The Listeners",
  "type": "make_sentences",
  "questions": [
    {
      "id": "tl_ms_1",
      "word": "Phantom",
      "meaning": "A ghost or spirit; something that appears to exist but has no physical reality",
      "sample_sentence": "The old castle was said to be haunted by a phantom that appeared every midnight in the tower room."
    },
    {
      "id": "tl_ms_2",
      "word": "Turret",
      "meaning": "A small tower, especially one at the corner of a building or castle",
      "sample_sentence": "The princess looked out from the turret of the medieval castle and watched the knights return from battle."
    },
    {
      "id": "tl_ms_3",
      "word": "Smote",
      "meaning": "Past tense of 'smite'; struck or hit with force",
      "sample_sentence": "The thunder smote the old oak tree, splitting it in half during the terrible storm last night."
    },
    {
      "id": "tl_ms_4",
      "word": "Champed",
      "meaning": "Chewed or bit upon noisily; munched",
      "sample_sentence": "The hungry horse champed the fresh hay eagerly after the long journey through the countryside."
    },
    {
      "id": "tl_ms_5",
      "word": "Ferny",
      "meaning": "Covered with or full of ferns (a type of leafy plant)",
      "sample_sentence": "We walked through the ferny forest path, where green ferns grew abundantly on both sides."
    },
    {
      "id": "tl_ms_6",
      "word": "Thronging",
      "meaning": "Crowding together in large numbers; gathering densely",
      "sample_sentence": "Thousands of fans were thronging the stadium entrance, eager to watch the final match of the cricket series."
    },
    {
      "id": "tl_ms_7",
      "word": "Dwelt",
      "meaning": "Lived or resided in a place",
      "sample_sentence": "The ancient tribe dwelt in the valley for centuries before migrating to the coastal regions."
    },
    {
      "id": "tl_ms_8",
      "word": "Stillness",
      "meaning": "The quality of being still; absence of movement or sound; complete quiet",
      "sample_sentence": "The stillness of the library was broken only by the occasional turning of pages by the students."
    },
    {
      "id": "tl_ms_9",
      "word": "Perplexed",
      "meaning": "Confused and puzzled; unable to understand something",
      "sample_sentence": "The students were perplexed by the complex mathematical problem that their teacher had given them to solve."
    },
    {
      "id": "tl_ms_10",
      "word": "Stirrup",
      "meaning": "A metal loop that hangs from a horse's saddle to support the rider's foot",
      "sample_sentence": "The rider placed his foot in the stirrup and swung himself onto the saddle of his magnificent Arabian horse."
    },
    {
      "id": "tl_ms_11",
      "word": "Surged",
      "meaning": "Moved suddenly and powerfully forward or upward, like a wave",
      "sample_sentence": "The crowd surged forward when the gates opened, everyone eager to get the best seats for the concert."
    },
    {
      "id": "tl_ms_12",
      "word": "Plunging",
      "meaning": "Falling or moving suddenly and forcefully downward or forward",
      "sample_sentence": "The waterfall was plunging from the cliff into the deep pool below, creating a magnificent spray of water."
    },
    {
      "id": "tl_ms_13",
      "word": "Shadowiness",
      "meaning": "The quality of being shadowy; full of shadows; dark and indistinct",
      "sample_sentence": "The shadowiness of the old mansion made it difficult to see clearly as we explored its abandoned rooms."
    },
    {
      "id": "tl_ms_14",
      "word": "Lone",
      "meaning": "Solitary; standing alone; without companions",
      "sample_sentence": "A lone traveler walked along the deserted road as the sun began to set behind the mountains."
    },
    {
      "id": "tl_ms_15",
      "word": "Eerie",
      "meaning": "Strange and frightening; mysterious in an unsettling way",
      "sample_sentence": "An eerie silence fell over the forest at midnight, making the campers feel uneasy in their tents."
    },
    {
      "id": "tl_ms_16",
      "word": "Hearkening",
      "meaning": "Listening attentively; paying attention to sounds",
      "sample_sentence": "The detective was hearkening to every word the witness said, hoping to find a clue in the testimony."
    },
    {
      "id": "tl_ms_17",
      "word": "Spake",
      "meaning": "An archaic past tense of 'speak'; spoke",
      "sample_sentence": "The wise old man spake words of wisdom that the young villagers would remember for years to come."
    },
    {
      "id": "tl_ms_18",
      "word": "Echoing",
      "meaning": "Repeating or reverberating sound; reflecting sound waves",
      "sample_sentence": "Her laughter kept echoing through the empty corridor, bouncing off the stone walls of the ancient building."
    },
    {
      "id": "tl_ms_19",
      "word": "Moonlit",
      "meaning": "Illuminated by the light of the moon",
      "sample_sentence": "The couple walked hand in hand along the moonlit beach, enjoying the peaceful evening by the sea."
    },
    {
      "id": "tl_ms_20",
      "word": "Host",
      "meaning": "A large number of people or things; a multitude",
      "sample_sentence": "A host of butterflies emerged from the garden, creating a colorful display against the blue sky."
    }
  ]
}
